; domain
;; source: ...
;; updates:
;;   - :negative-preconditions added
;;   - turn_to action has a new precondition (not (pointing ?s ?d_new))

(define (domain satellite)
  (:requirements :strips :typing :negative-preconditions)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and
        (pointing ?s ?d_prev)
        (not (pointing ?s ?d_new)))
   :effect (and
        (pointing ?s ?d_new)
        (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and
        (on_board ?i ?s)
        (power_avail ?s))
   :effect (and
        (power_on ?i)
        (not (calibrated ?i))
        (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
;; satellites=4, instruments=5, modes=1, directions=4, out_folder=training/easy, instance_id=21, seed=54

(define (problem satellite-21)
 (:domain satellite)
 (:objects 
    sat1 sat2 sat3 sat4 - satellite
    ins1 ins2 ins3 ins4 ins5 - instrument
    mod1 - mode
    dir1 dir2 dir3 dir4 - direction
    )
 (:init 
    (pointing sat1 dir2)
    (pointing sat2 dir4)
    (pointing sat3 dir3)
    (pointing sat4 dir4)
    (power_avail sat1)
    (power_avail sat2)
    (power_avail sat3)
    (power_avail sat4)
    (calibration_target ins1 dir4)
    (calibration_target ins2 dir4)
    (calibration_target ins3 dir2)
    (calibration_target ins4 dir4)
    (calibration_target ins5 dir3)
    (on_board ins1 sat2)
    (on_board ins2 sat3)
    (on_board ins3 sat1)
    (on_board ins4 sat4)
    (on_board ins5 sat1)
    (supports ins2 mod1)
    (supports ins1 mod1)
    (supports ins3 mod1)
    (supports ins5 mod1)
    (supports ins4 mod1))
 (:goal  (and 
   (have_image dir3 mod1)
   (have_image dir4 mod1)
   (have_image dir1 mod1))))

; plan
1. (switch_on ins4 sat4)
   deleted: (power_avail sat4)
   added: (power_on ins4)
   goals met: 0 of 3
2. (calibrate sat4 ins4 dir4)
   added: (calibrated ins4)
   goals met: 0 of 3
3. (take_image sat4 dir4 ins4 mod1)
   added: (have_image dir4 mod1)
   goals met: 1 of 3
4. (turn_to sat4 dir1 dir4)
   deleted: (pointing sat4 dir4)
   added: (pointing sat4 dir1)
   goals met: 1 of 3
5. (take_image sat4 dir1 ins4 mod1)
   added: (have_image dir1 mod1)
   goals met: 2 of 3
6. (turn_to sat4 dir3 dir1)
   deleted: (pointing sat4 dir1)
   added: (pointing sat4 dir3)
   goals met: 2 of 3
7. (take_image sat4 dir3 ins4 mod1)
   added: (have_image dir3 mod1)
   goals met: 3 of 3
